<template>
  <div class="page">
    <SampleOne
      v-for="(block, idx) in blocks"
      :key="idx"
      :lang="lang"
      :to="block.to"
      :titleLeft="block.titleLeft"
      :contentLeft="block.contentLeft"
    />
    <SampleOneImage class="central-main-content" :lang="lang" :imageSrc="MainImage" />
  </div>
</template>

<style>
.page {
  margin-top: 11%;
}
</style>

<script setup>
import { computed } from "vue";
import SampleOne from "../../components/SpOne.vue";
import SampleOneImage from "../../components/SpOneImage.vue";
import MainImage from "../../assets/images/Memleket.jpeg";

const props = defineProps({
  lang: {
    type: String,
    default: "kz",
  },
});

const blocksData = [
  {
    to: {
      kz: "https://online.zakon.kz/Document/?doc_id=31376056&pos=7;-118#pos=7;-118",
      ru: "https://online.zakon.kz/Document/?doc_id=31376056&pos=7;-118#pos=7;-118",
    },
    titleLeft: {
      kz: "ҚАЗАҚСТАН РЕСПУБЛИКАСЫНЫҢ ЗАҢЫ Мемлекеттік көрсетілетін қызметтер туралы",
      ru: "Государственные услуги предоставляемые в организациях образования",
    },
  },
  {
    to: {
      kz: "https://adilet.zan.kz/rus/docs/V2000019982",
      ru: "/news/ministerstvo-daryn-ru",
    },
    titleLeft: {
      kz: "Мемлекеттік көрсетілетін қызметтер тізілімін бекіту туралы",
      ru: "Реестр государственных услуг",
    },
  },
  {
    to: {
      kz: "/news/ministerstvo-daryn-kz",
      ru: "/news/ministerstvo-daryn-ru",
    },
    titleLeft: {
      kz:
        "Бастауыш, негізгі орта және жалпы орта білімнің жалпы білім беретін оқу бағдарламаларын іске асыратын білім беру ұйымдарына оқуға қабылдаудың үлгілік қағидаларын бекіту туралы",
      ru: "Типовые правила приема на обучение в организации образования",
    },
  },
  {
    to: {
      kz: "/news/ministerstvo-daryn-kz",
      ru: "/news/ministerstvo-daryn-ru",
    },
    titleLeft: {
      kz:
        "Білім туралы құжаттардың түрлерін, білім туралы мемлекеттік үлгідегі құжаттардың нысандарын және оларды есепке алу мен беру қағидаларын, білім туралы өзіндік үлгідегі құжаттардың мазмұнына қойылатын негізгі талаптарды және оларды есепке алу мен беру қағидаларын, сондай-ақ білім беру ұйымдарында білім алуды аяқтамаған адамдарға берілетін анықтаманың нысанын бекіту туралы",
      ru: "Правила выдачи документов об образовании государственного образца",
    },
  },
  {
    to: {
      kz: "/news/ministerstvo-daryn-kz",
      ru: "/news/ministerstvo-daryn-ru",
    },
    titleLeft: {
      kz:
        "Қазақстан Республикасының Мәдениет және ақпарат министрлігі «Дарын» мемлекеттік жастар сыйлығына байқау жариялайды",
      ru:
        "Правила оказания государственной услуги «Прием документов для организации индивидуального бесплатного обучения на дому детей, которые по состоянию здоровья в течение длительного времени не могут посещать организации начального, основного среднего, общего среднего образования»",
    },
  },
  {
    to: {
      kz: "/news/ministerstvo-daryn-kz",
      ru: "/news/ministerstvo-daryn-ru",
    },
    titleLeft: {
      kz:
        "Қазақстан Республикасының Мәдениет және ақпарат министрлігі «Дарын» мемлекеттік жастар сыйлығына байқау жариялайды",
      ru:
        "Правила обучения в форме экстерната и оказания государственной услуги «Выдача разрешения на обучение в форме экстерната в организациях основного среднего, общего среднего образования»",
    },
  },
  {
    to: {
      kz: "/news/ministerstvo-daryn-kz",
      ru: "/news/ministerstvo-daryn-ru",
    },
    titleLeft: {
      kz:
        "Қазақстан Республикасының Мәдениет және ақпарат министрлігі «Дарын» мемлекеттік жастар сыйлығына байқау жариялайды",
      ru:
        "Правила и условия проведения аттестации педагогов, занимающих должности в организациях образования, реализующих общеобразовательные учебные программы дошкольного воспитания и обучения, начального, основного среднего и общего среднего образования, образовательные программы технического и профессионального, послесреднего, дополнительного, специализированного и специального образования, и иных гражданских служащих в области образования и науки",
    },
  },
];

const blocks = computed(() =>
  blocksData.map((b) => ({
    to: b.to[props.lang],
    titleLeft: b.titleLeft[props.lang],
  }))
);
</script>
